In [20]:
#import yaml

In [22]:
with open("config.yaml", "r") as f:
    try:
        config_file = yaml.safe_load(f)
        print(config_file["data_source"]["openml"])
        print(type(config_file["data_source"]["openml"]))
    except yaml.YAMLError as exc:
        print(exc)

https://www.openml.org/data/get_csv/16826755/phpMYEkMl
<class 'str'>

In [23]:
#import re

# to handle datasets
#import pandas as pd
# to persist the model and the scaler
#import joblib

#import config
#import yaml

with open("config.yaml","r") as file:
    config_file = yaml.safe_load(file)

def load_data():
    data = pd.read_csv(config_file["data_source"]["openml"])
    return data

In [24]:
load_data().head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29,0,0,24160,211.3375,B5,S,2,?,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.55,C22 C26,S,11,?,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2,1,2,113781,151.55,C22 C26,S,?,?,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30,1,2,113781,151.55,C22 C26,S,?,135,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25,1,2,113781,151.55,C22 C26,S,?,?,"Montreal, PQ / Chesterville, ON"

In [25]:
from sklearn.base import BaseEstimator, TransformerMixin

In [26]:
#from sklearn.model_selection import train_test_split

In [27]:
d = load_data()

In [28]:
d.drop(labels= ["name"], axis= 1)

,pclass,survived,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,female,29,0,0,24160,211.3375,B5,S,2,?,"St Louis, MO"
1,1,1,male,0.9167,1,2,113781,151.55,C22 C26,S,11,?,"Montreal, PQ / Chesterville, ON"
2,1,0,female,2,1,2,113781,151.55,C22 C26,S,?,?,"Montreal, PQ / Chesterville, ON"
3,1,0,male,30,1,2,113781,151.55,C22 C26,S,?,135,"Montreal, PQ / Chesterville, ON"
4,1,0,female,25,1,2,113781,151.55,C22 C26,S,?,?,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,female,14.5,1,0,2665,14.4542,?,C,?,328,?
1305,3,0,female,?,1,0,2665,14.4542,?,C,?,?,?
1306,3,0,male,26.5,0,0,2656,7.225,?,C,?,304,?
1307,3,0,male,27,0,0,2670,7.225,?,C,?,?,?
1308,3,0,male,29,0,0,315082,7.875,?,S,?,?,?

In [29]:
import data_managers

In [31]:
new_data = data_managers.load_data()

In [33]:
X_train, X_test, y_train, y_test = data_managers.data_split(new_data)

In [34]:
X_train

      pclass     sex      age  sibsp  parch      fare cabin embarked title
1118       3    male  25.0000      0      0    7.9250   NaN        S    Mr
44         1  female  41.0000      0      0  134.5000   E40        C  Miss
1072       3    male      NaN      0      0    7.7333   NaN        Q    Mr
1130       3  female  18.0000      0      0    7.7750   NaN        S  Miss
574        2    male  29.0000      1      0   21.0000   NaN        S    Mr
...      ...     ...      ...    ...    ...       ...   ...      ...   ...
763        3  female   0.1667      1      2   20.5750   NaN        S  Miss
835        3    male      NaN      0      0    8.0500   NaN        S    Mr
1216       3  female      NaN      0      0    7.7333   NaN        Q  Miss
559        2  female  20.0000      0      0   36.7500   NaN        S  Miss
684        3  female  32.0000      1      1   15.5000   NaN        Q   Mrs

[1047 rows x 9 columns]

In [ ]:
from sklearn.preprocessing import StandardScaler
from sklearn.linear_model import LogisticRegression

In [4]:
import data_managers

In [23]:
d = data_managers.load_data("yes")

TypeError: load_data() takes 0 positional arguments but 1 was given

In [28]:
split = "no"
if split == "yes":
    X_train, X_test, y_train, y_test = train_test_split(                                                          data.drop(config_file["base"]["target_column"], axis=1),  # predictors
                                                            data[config_file["base"]["target_column"]],  # target
                                                            test_size= config_file["base"]["test_size"],  # percentage of obs in test set
                                                            random_state= config_file["base"]["random_state"]  # seed to ensure reproducibility
                                                            )
return X_train, X_test, y_train, y_test

    #return X_train, X_test, y_train, y_test

In [ ]:
x = 1

In [19]:
data_managers.data_split(titanic_data)

(      pclass     sex      age  sibsp  parch      fare cabin embarked title
 1118       3    male  25.0000      0      0    7.9250   NaN        S    Mr
 44         1  female  41.0000      0      0  134.5000   E40        C  Miss
 1072       3    male      NaN      0      0    7.7333   NaN        Q    Mr
 1130       3  female  18.0000      0      0    7.7750   NaN        S  Miss
 574        2    male  29.0000      1      0   21.0000   NaN        S    Mr
 ...      ...     ...      ...    ...    ...       ...   ...      ...   ...
 763        3  female   0.1667      1      2   20.5750   NaN        S  Miss
 835        3    male      NaN      0      0    8.0500   NaN        S    Mr
 1216       3  female      NaN      0      0    7.7333   NaN        Q  Miss
 559        2  female  20.0000      0      0   36.7500   NaN        S  Miss
 684        3  female  32.0000      1      1   15.5000   NaN        Q   Mrs

 [1047 rows x 9 columns],
       pclass     sex   age  sibsp  parch     fare cabin embarked title
 1139       3    male  38.0      0      0   7.8958   NaN        S    Mr
 533        2  female  21.0      0      1  21.0000   NaN        S  Miss
 459        2    male  42.0      1      0  27.0000   NaN        S    Mr
 1150       3    male   NaN      0      0  14.5000   NaN        S    Mr
 393        2    male  25.0      0      0  31.5000   NaN        S    Mr
 ...      ...     ...   ...    ...    ...      ...   ...      ...   ...
 753        3    male  22.0      0      0   8.0500   NaN        S    Mr
 1052       3    male   NaN      0      0   7.8958   NaN        S    Mr
 426        2    male  30.0      0      0  13.0000   NaN        S    Mr
 554        2    male  26.0      0      0  13.0000   NaN        S    Mr
 1213       3    male   NaN      0      0   8.0500   NaN        S    Mr

 [262 rows x 9 columns],
 1118    0
 44      1
 1072    0
 1130    0
 574     0
        ..
 763     1
 835     0
 1216    1
 559     1
 684     0
 Name: survived, Length: 1047, dtype: int64,
 1139    0
 533     1
 459     0
 1150    0
 393     0
        ..
 753     0
 1052    0
 426     0
 554     0
 1213    0
 Name: survived, Length: 262, dtype: int64)